a/frontend/views/site/index.php

SELECT * FROM `brand`
---
?>
<?php
$products = Product::findBest()->all();
$brands = Brand::find()->all();