a/frontend/views/layouts/main.php

SELECT * FROM `brand`
---
?>
<?php
$this->beginPage();
$brands = Brand::find()->all();