a/frontend/views/checkout/index.php

use backend\models\Brand;

$model->amount = $cost;
$brands = Brand::find()->all();
---
SELECT * FROM `brand`