a/frontend/views/product/detail.php

SELECT * FROM `brand`
---
?>
<?php
$products = Product::findBest()->all();
$brands = Brand::find()->all();