a/frontend/controllers/CheckoutController.php

    function actionIndex() {
        $model = new Checkout();
        $cart = new Cart();
        $cartstore = $cart->cartstore;
        $cost = $cart->getCost;
        if($model->load(Yii::$app->request->post())) {
            $post = Yii::$app->request->post()['Checkout'];
            foreach($cartstore as $item) :
            {
                $orderItem = new OrderItem;
                $orderItem->buyer_name = $post['buyer_name'];
                $orderItem->buyer_phone = $post['buyer_phone'];
                $orderItem->buyer_address = $post['buyer_address'];
                $orderItem->buy_date =  date('Y-m-d');
                $orderItem->product_id = $item->id;
                $orderItem->quantity = $item->qtt;
                if($orderItem->save())
---
INSERT INTO `orderitem` (`buyer_name`, `buyer_phone`, `buyer_address`, `buy_date`, `product_id`, `quantity`) VALUES ('a', 'a', 'a', '2021-01-01', 17, 1)