a/frontend/controllers/ProductController.php

SELECT * FROM `product` WHERE `id`='2'
---
    public function actionIndex($id) {

        $product = Product::findOne($id);